/************************************************************************/
/*                       Main.c - 主方法实现文件                        */
/*                                                                      */
/* 程序入口实现                                                         */
/*                                                                      */
/************************************************************************/

#include "Optimize.h"

// -----------------------------------------------------------------------
// INCLUDE
#include <STDIO.H>
#include <STDLIB.H>
#include <WINDOWS.H>
#include "Public.h"
#include "Game.h"
#include "Process.h"

// -----------------------------------------------------------------------
// 宏定义
#define GAME_PROC_NAME "PlantsVsZombies.exe"		/* 宏   游戏进程名   */

// -----------------------------------------------------------------------
// 全局变量声明
HANDLE g_hProcess;									/* 全局 游戏进程句柄 */

// -----------------------------------------------------------------------
// 函数声明


// -----------------------------------------------------------------------
// 函数定义

int 
main
(void) 
{
	// --------------------------------------------------------------------
	// 函数局部变量处理

	// 局部变量声明
	BOOL bApRet;										/* 自动拾取结果 */

	// 局部变量初始化
	bApRet = FALSE;

	// --------------------------------------------------------------------
	// 函数体

	// 打开进程
	g_hProcess = GetProcessHandleByName(GAME_PROC_NAME);
	if (!g_hProcess) {
		printf("打开进程 %s 失败！\n", GAME_PROC_NAME);
		goto CLOSE;
	}

	// 检查版本
	if (!CheckVersion()) {
		puts("游戏版本不匹配！");
		goto CLOSE;
	}

	// 自动拾取修改
	bApRet = AutoPick();
	printf("自动拾取修改%s！\n", bApRet ? "成功" : "失败");

	// --------------------------------------------------------------------
	// 函数返回前需要处理的过程
CLOSE:
	if (g_hProcess != NULL) {
		CloseHandle(g_hProcess);
	}

	if (!bApRet) {
		system("pause>nul");
	}

	// --------------------------------------------------------------------
	// 函数返回值
//RET:
	return bApRet ? EXIT_SUCCESS : EXIT_FAILURE;
}