/************************************************************************/
/*                       Memory.h - 内存操作头文件                      */
/*                                                                      */
/* 包含对于 Windows 进程内存的部分操作                                  */
/*                                                                      */
/************************************************************************/

// -----------------------------------------------------------------------
// 防止重复包含 开始
#pragma once
#ifndef _MEMORY_H_
#define _MEMORY_H_

// -----------------------------------------------------------------------
// INCLUDE
#include "Public.h"

// -----------------------------------------------------------------------
// 宏定义

// -----------------------------------------------------------------------
// 全局变量声明

// -----------------------------------------------------------------------
// 函数声明

/******************************************
 * @brief 读取指定内存数据
 * 
 * @param [in] hProcess		进程句柄
 * @param [in] dwBaseAddr	进程内存基址
 * @param [in] dwSize		数据类型大小
 * @param [in] nLen			可变参数长度
 * @param [in] args			可变参数
 * @return 返回指定内存数据
 ******************************************/
DWORD 
ReadMemory
(HANDLE hProcess, DWORD dwBaseAddr, DWORD dwSize, int nLen, ...);

/******************************************
 * @brief 写入指定内存数据
 * 
 * @param [in] hProcess		进程句柄
 * @param [in] dwBaseAddr	进程内存基址
 * @param [in] dwValue		数据值
 * @param [in] dwSize		数据类型大小
 * @param [in] nLen			可变参数长度
 * @param [in] args			可变参数
 * @return 返回写入内存数据是否成功
 ******************************************/
BOOL 
WriteMemory
(HANDLE hProcess, DWORD dwBaseAddr, DWORD dwValue, DWORD dwSize, int nLen, ...);

// -----------------------------------------------------------------------
// 防止重复包含 结束
#endif /* _MEMORY_H_ */
