/************************************************************************/
/*                       Process.c - 进程操作实现文件                   */
/*                                                                      */
/* 包含对于 Windows 进程的部分操作                                      */
/*                                                                      */
/************************************************************************/

// -----------------------------------------------------------------------
// INCLUDE
#include "Process.h"
#include <TLHELP32.H>

// -----------------------------------------------------------------------
// 宏定义

// -----------------------------------------------------------------------
// 全局变量声明

// -----------------------------------------------------------------------
// 函数声明

/******************************************
 * @brief 通过进程名返回 pid

 * @param [in] szName 进程名
 * @return 成功返回指定进程名的 pid
           失败返回 0
 ******************************************/
static DWORD 
GetProcessPidByName
(LPCSTR szName);

// -----------------------------------------------------------------------
// 函数定义

/******************************************
 * @brief 通过进程名返回进程句柄
 * 
 * @param [in] szName 进程名
 * @return 成功返回指定进程名的句柄
           失败返回 0
 ******************************************/
HANDLE 
GetProcessHandleByName
(LPCSTR szName) 
{
	// --------------------------------------------------------------------
	// 函数局部变量处理

	// 局部变量声明
	DWORD	dwPid	;									/* 进程 pid  */
	HANDLE	hProcess;									/* 进程句柄  */

	// 局部变量初始化
	dwPid		= GetProcessPidByName(szName);
	hProcess	= 0;

	// --------------------------------------------------------------------
	// 函数体

	// 如果进程 pid 获取失败，返回 0
	if (!dwPid) {
		goto RET;
	}

	// 打开进程获取句柄
	hProcess = OpenProcess(PROCESS_ALL_ACCESS, FALSE, dwPid);

	// --------------------------------------------------------------------
	// 函数返回前需要处理的过程
//CLOSE:

	// --------------------------------------------------------------------
	// 函数返回值
RET:
	return hProcess;
}

/******************************************
 * @brief 通过进程名返回 pid
 * 
 * @param [in] szName 进程名
 * @return 成功返回指定进程名的 pid
           失败返回 0
 ******************************************/
static DWORD 
GetProcessPidByName
(LPCSTR szName) 
{
	// --------------------------------------------------------------------
	// 函数局部变量处理

	// 局部变量声明
	DWORD			dwPid		;						/* 进程 pid     */
	HANDLE			hSnapshot	;						/* 进程快照     */
	PROCESSENTRY32	pe32		;						/* 进程信息实体 */

	// 局部变量初始化
	dwPid		= 0													;
	hSnapshot	= CreateToolhelp32Snapshot(TH32CS_SNAPPROCESS, 0)	;

	// --------------------------------------------------------------------
	// 函数体

	// 如果进程快照无效，返回 0
	if (hSnapshot == INVALID_HANDLE_VALUE) {
		goto RET;
	}

	// 创建进程信息实体
	pe32.dwSize = sizeof(PROCESSENTRY32);

	// 如果对进程信息实体赋值失败，返回 0
	if(!Process32First(hSnapshot, &pe32)){
		goto CLOSE;
	}

	// 循环查找是否有指定名称的进程信息
	do {
		// 如果查找成功，返回 pid
		if(!strcmp(szName, pe32.szExeFile)){
			dwPid = pe32.th32ProcessID;

			goto CLOSE;
		}
	} while (Process32Next(hSnapshot, &pe32));

	// --------------------------------------------------------------------
	// 函数返回前需要处理的过程
CLOSE:
	// 关闭快照
	CloseHandle(hSnapshot);

	// --------------------------------------------------------------------
	// 函数返回值
RET:
	return dwPid;
}
